### This is the challenge mentioned in the Lambda DataScience Toolkit for DS-Sprint-01-Dealing-With-Data

In [13]:
import pandas as pd

data = {'company': ['Grow Mart', 'Plant Depot', "Trees'R'Us"],
       'year_founded': [1973, 1973, 1985],
       'revenue': [265, 302, 123],
       'expenses': [183, 240, 130]}

df = pd.DataFrame(data)
df

       company  year_founded  revenue  expenses
0    Grow Mart          1973      265       183
1  Plant Depot          1973      302       240
2   Trees'R'Us          1985      123       130

In [15]:
df.index = df['company']
df

                 company  year_founded  revenue  expenses
company
Grow Mart      Grow Mart          1973      265       183
Plant Depot  Plant Depot          1973      302       240
Trees'R'Us    Trees'R'Us          1985      123       130

In [20]:
df.drop('company', axis=1, inplace=True)

In [21]:
df

             year_founded  revenue  expenses
company
Grow Mart            1973      265       183
Plant Depot          1973      302       240
Trees'R'Us           1985      123       130

In [23]:
import numpy as np
df['is_profitable'] = np.where(df['revenue'] - df['expenses'] > 0, True, False)

In [24]:
df

             year_founded  revenue  expenses  is_profitable
company
Grow Mart            1973      265       183           True
Plant Depot          1973      302       240           True
Trees'R'Us           1985      123       130          False